[
  {
    "source": {
    "id": null,
    "name": "Marion Star"
    },
    "author": "Marion Star",
    "title": "United Church Homes selected to test new Medicare dementia care model - Marion Star",
    "description": "The Guiding an Improved Dementia Experience (GUIDE) Model aims to increase supports for people living with dementia and their caregivers.",
    "url": "https://www.marionstar.com/story/news/local/2024/09/07/united-church-homes-selected-for-test-medicare-dementia-care-model-cms-guide-caregivers-respite/75101086007/",
    "urlToImage": "https://www.marionstar.com/gcdn/authoring/authoring-images/2024/07/01/PMAN/74266417007-united-church-homes-logo.jpg?crop=468,262,x123,y0&width=468&height=262&format=pjpg&auto=webp",
    "publishedAt": "2024-09-08T22:52:35Z",
    "content": "United Church Homes has been selected by the Centers for Medicare &amp; Medicaid Services (CMS) to participate in a new Medicare alternative payment model designed to support people living with demen… [+2887 chars]"
  },
  {
    "source": { "id": "cnn","name": "CNN" },
    "author": "Issy Ronald",
    "title": "Taylor Fritz seeks to be first American man since 2003 to win major singles title, faces No. 1 Jannik Sinner in US Open final - CNN",
    "category": "Sports",
    "description": "The last time an American man won a major singles title, George W. Bush was still in his first term as US president, Myspace had just launched and Tom Brady had one Super Bowl win.",
    "url": "https://www.cnn.com/2024/09/08/sport/us-open-mens-final-sinner-fritz-intl-sptl/index.html",
    "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2169891419-copy.jpg?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-09-08T07:00:00Z",
    "content": "The last time an American man won a grand slam singles title, George W. Bush was still in his first term as US president, Myspace had just launched and Tom Brady only had one Super Bowl victory to his name. Now, Taylor Fritz, who was just 5 years old when Andy Roddick won the US Open in 2003, has an opportunity to complete another American victory at Arthur Ashe Stadium when he takes on world No. 1 Jannik Sinner in the men’s singles final on Sunday. Fritz, the world No. 12, will step out onto court as the underdog but has displayed imperious form on his run to the final, dispatching with Alexander Zverev and Casper Ruud before defeating fellow American Frances Tiafoe in the semifinals. “It’s the reason I do what I do, the reason why I work so hard. I’m in the final of the US Open,” he said tearfully after winning his semifinal. “It’s a dream come true and I’m going to give it everything I possibly have. I know that for a fact.”"
  },
  {
    "source": {
    "id": "usa-today",
    "name": "USA Today"
    },
    "author": "Brian Truitt",
    "title": "Bruce Springsteen talks 'Road Diary' and being a band boss: 'You're not alone' - USA TODAY",
    "category": "Entertainment",
    "description": "The E Street Band is a \"benevolent dictatorship\" and Bruce Springsteen is, of course, \"The Boss\" in the new documentary \"Road Diary.\"",
    "url": "https://www.usatoday.com/story/entertainment/movies/2024/09/09/bruce-springsteen-road-diary-documentary/75139772007/",
    "urlToImage": "https://www.usatoday.com/gcdn/authoring/authoring-images/2024/09/09/USAT/75139791007-afp-2170281264.jpg?crop=2839,1597,x0,y49&width=2839&height=1597&format=pjpg&auto=webp",
    "publishedAt": "2024-09-09T06:16:36Z",
    "content": "TORONTO Bruce Springsteen sums up his new documentary succinctly: That's how we make the sausage.\r\nThe New Jersey rock music legend premiered Road Diary: Bruce Springsteen and the E Street Band (stre… [+3705 chars]"
    },
  { "source": {"id": null,"name": "CBS Sports" },
    "author": null,
    "title": "Tennessee Volunteers vs. NC State Wolfpack Live Score and Stats - September 7, 2024 Gametracker - CBS Sports",
    "category": "Sports",
    "description": "Live COLLEGEFOOTBALL scores at CBSSports.com. Check out the COLLEGEFOOTBALL scoreboard, box scores and game recaps.",
    "url": "https://www.cbssports.com/college-football/gametracker/recap/NCAAF_20240907_TENN@NCST/",
    "urlToImage": "https://sportsfly.cbsistatic.com/fly-0773/bundles/sportsmediacss/images/fantasy/default-article-image-large.png",
    "publishedAt": "2024-09-08T06:42:25Z",
    "content": "CHARLOTTE, N.C. (AP) The Tennessee Volunteers made a big statement on Saturday night. Quarterback Nico Iamaleava combined for 276 yards and three touchdowns, former walk-on safety Will Brooks' 85-yard interception return for a score highlighted a dominant defensive performance and the 14th-ranked Vols trounced No. 24 North Carolina State 51-10 in the Duke's Mayo Classic. Iamaleava completed 16 of 23 passes for 211 yards and threw TDs to Miles Kitselman and Holden Staes. He also ran for 65 yards, including a 31-yard score, as the Vols scored on eight of their 11 possessions with the redshirt freshman under center. “He played within himself and responded well to adversity and that is one of the things we haven't seen from him,” Tennessee coach Josh Heupel said of Iamaleava overcoming two interceptions. “I am really proud of his demeanor.” Despite the two mistakes, Iamaleava passed the first major test of his starting career with flying colors. The Vols have now scored 120 points in their first two games following a 69-3 win over Chattanooga in the opener. “It was a little sloppy in the beginning but I thought we finished strong in the second half,” Iamaleava said. Dylan Sampson ran for 132 yards and two touchdowns as Tennessee (2-0) outgained NC State 460 yards to 143. Tennessee limited NC State quarterback Grayson McCall to 104 yards passing and forced three turnovers. The Vols held the Wolfpack to 39 yards rushing on 28 carries and NC State's only touchdown came on a pick-six. Heupel called it an “elite” defensive performance. “The standard at Tennessee is to be elite on defense. This is the home of Reggie White, Al Wilson and Eric Berry,Heupel said. The offense wasn't too bad either. Iamaleava didn't take long to show off his skillset, breaking containment and outracing two defenders to pick up 12 yards on a third-and-7 play to keep the Vols' opening drive alive. Tennessee would break through on its second drive with a series of short completions by Iamaleava before Sampson raced nine yards up the middle for a touchdown. After the teams traded field goals, NC State (1-1) drove deep into Tennessee territory before McCall overthrew tight end Justin Joly in the flat and Brooks grabbed the first interception of his career and raced untouched down the left sideline for the touchdown and a 17-3 lead. It was the 10th-longest INT return for a touchdown in school history and the longest since Daniel Bituli’s 97-yarder against Alabama in 2017. “That was part of the straw that broke the camel's back,” Heupel said. Max Gilbert tacked on a 45-yard field goal at the end of the first half to give the Vols a 17-point lead at the break. Things quickly went from bad to worse for NC State in the second half. On Tennessee's opening possession of the third quarter, Iamaleava moved the chains with a fourth-down run and then found a wide-open Kitselman down the left sideline for a touchdown. Dominic Bailey followed with a strip of McCall and recovered at the NC State 22-yard line leading to Gilbert's third field of the game and the rout was on. And when NC State was stuffed on a desperation fourth-and-1 run in its own territory, Iamaleava put the game away with a burst up the middle on a QB draw with 4:07 left in the third quarter. “It got away from us. It snowballed as it went, NC State coach Dave Doeren said. “We have a lot of work to do to get back to it.” Doeren said he plans to stick with McCall at quarterback. “He's mad at himself, but he has to get back and flush it,” Doeren said. We have great confidence in Grayson. As a head coach I completely believe in him. Offensively the Vols used a lot of two tight end personnel, something that took the Wolfpack by surprise. “This is deepest our tight end room has been and it will be a part of what we continue to do,” Heupel said. Tennessee: The Vols' up-tempo offense was clicking on all cylinders after the game's first drive and their defense was outstanding. This has the look of a team that has the potential to compete for a national championship. NC State: The Wolfpack offense looked completely out of sync as it managed just 27 yards in the second half and turned it over three times. Unlike last week against FCS school Western Carolina, NC State wasn't able to mount a fourth-quarter rally. With a strong showing against a Top 25 team, the Vols are likely to move up in the rankings possibly into the Top 10. The Wolfpack can say goodbye to their Top 25 ranking after a lackluster performance last week against Western Carolina and this debacle. Tennessee: Will be a big favorite on Saturday when it hosts Kent State. NC State: Returns home to play Louisiana Tech on Saturday."
  },
  {
  "source": { "id": "business-insider", "name": "Business Insider" },
  "author": "Hasan Chowdhury",
  "title": "X is banned in Brazil and China, but Elon Musk is only in a spat with one. The secret? Tesla.",
  "description": "Elon Musk has been critical of Brazil's decision to ban X on free speech grounds, but has long remained silent on China's decision to do the same.",
  "url": "https://www.businessinsider.com/elon-musk-brazil-x-ban-china-tesla-2024-9",
  "urlToImage": "https://i.insider.com/66d9b9ce5444ffafa762697a?width=1200&format=jpeg",
  "publishedAt": "2024-09-06T09:02:49Z",
  "content": "Elon Musk's attack on Brazil over its ban on X contrasts his silence on China, where the app has been blocked since 2009.Beata Zawrzel/NurPhoto/Getty Images\r\n<ul><li>Elon Musk has been busy attacking… [+5741 chars]"
  },
  {
  "source": { "id": "newsweek", "name": "Newsweek" },
  "author": "Jake Lingeman",
  "title": "Hyundai Adds Range and Ride Height With Off-Road 2025 Ioniq 5 XRT",
  "description": "The updated 2025 Hyundai Ioniq 5 lineup now gets beefier off-road XRT trim, joining bigger Santa Fe.",
  "url": "https://www.newsweek.com/hyundai-adds-range-ride-height-off-road-2025-ioniq-5-xrt-1948895",
  "urlToImage": "https://d.newsweek.com/en/full/2464479/2025-hyundai-ioniq-5.jpg",
  "publishedAt": "2024-09-06T09:00:01Z",
  "content": "The electric Hyundai Ioniq 5 was one of the best and best-looking EVs when it came out in 2022 with a sporty hatchback body with a midsize SUV interior. It also won several awards here at Newsweek. T… [+4219 chars]"
  },
  {
  "source": { "id": "fortune", "name": "Fortune" },
  "author": "Jill Colvin, Adriana Gomez Licon, Josh Boak, The Associated Press",
  "title": "Trump tells business leaders that increasing tariffs on foreign imports will help solve rising child care costs",
  "description": "In June, the right-leaning Tax Foundation estimated that Trump’s proposed tariffs would amount to a $524 billion yearly tax hike that would shrink the economy and cost the equivalent of 684,000 jobs.",
  "url": "https://fortune.com/2024/09/06/trump-increasing-tariffs-foreign-imports-rising-child-care-costs/",
  "urlToImage": "https://fortune.com/img-assets/wp-content/uploads/2024/09/AP24249629642205-e1725612197520.jpg?resize=1200,600",
  "publishedAt": "2024-09-06T08:50:43Z",
  "content": "Former President Donald Trump suggested to business leaders Thursday that his plans to increase tariffs on foreign imports would solve seemingly unrelated challenges such as the rising cost of child “We are going to receive trillions of dollars, and as much as people say that child care is expensive, relatively speaking, it is not very expensive compared to the numbers we are going to receive.” said. Trump has supported tariffs to appeal to working-class voters who oppose free-trade deals and the outsourcing of factories and jobs. But in his speech Thursday and in his broader economic plans, Trump has made a broader — and to some, implausible — promise about tariffs: that they can raise trillions of dollars to fund his agenda without those costs being passed on to consumers in the form of higher prices. His campaign attacks Democratic candidate Kamala Harris’ proposals to raise corporate tax rates, saying workers would ultimately pay for them in the form of fewer jobs and lower incomes. But taxes on foreign imports would have a similar effect, with businesses and consumers having to absorb those costs in the form of higher prices. According to the Bureau of Economic Analysis, the United States imported $3.8 trillion worth of goods last year. Trump has talked in the past about universal tariffs of at least 10%, if not more, though he has not given details on how such duties would be implemented."
  },
  {
  "source": { "id": null, "name": "Setopati.com" },
  "author": "Setopati :: Setopati",
  "title": "Fire at Tesla showroom brought under control (Pictures)",
  "description": "The fire that broke out at a showroom of Tesla vehicles in Naxal of Kathmandu has been brought under control.",
  "url": " https://en.setopati.com/social/163633 ",
  "urlToImage": "https://en.setopati.com/uploads/editor/Tesla-Showroom-Fire/Tesla-Showroom-Fire-Banner.jpeg",
  "publishedAt": "2024-09-06T08:49:53Z",
  "content": "The fire that broke out at a showroom of Tesla vehicles in Naxal of Kathmandu has been brought under control.\r\nThe fire, which started at around 12:15 PM Friday, was extinguished with the help of fir… [+289 chars]"
  },
  {
    "source": {"id": "techcrunch", "name": "TechCrunch"},
    "author": "Alex Wilhelm and Theresa Loconsolo",
    "title": "$450M for Noname, two billion-dollar rounds, and good news for crypto startups | TechCrunch",
    "category": "Technology",
    "description": "This morning on Equity, not only do we have good news for crypto founders, we're also digging into Akamai spending $450 million for API security firm Noname, and billion dollar deals from Wiz and Wayve.",
    "url": "https://techcrunch.com/2024/05/08/450m-for-noname-two-billion-dollar-rounds-and-good-news-for-crypto-startups/",
    "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/07/GettyImages-942480316.jpg?resize=1200,835",
    "publishedAt": "2024-05-08T15:01:51Z",
    "content": "Good news, crypto founders: Venture capital activity is picking up in your sector after falling to multi-year lows in late 2023. Put another way, venture folks appear more web3-bullish than before, e… [+1599 chars]"
  },
  {
  "source": {"id": null,"name": "CNBC"},
  "author": "Rebecca Picciotto",
  "title": "Yellen says U.S. economy remains solid, on path to 'soft landing' with no meaningful layoffs - CNBC",
  "category": "Business",
  "description": "Federal Reserve Chair Jerome Powell said in August that the U.S. economy might be ready for an interest rate cut.",
  "url": "https://www.cnbc.com/2024/09/07/yellen-says-us-economy-remains-solid-heading-toward-soft-landing.html",
  "urlToImage": "https://image.cnbcfm.com/api/v1/image/108030594-1725652477107-gettyimages-2170574271-bb2_4502_cdgy76wl.jpeg?v=1725652505&w=1920&h=1080",
  "publishedAt": "2024-09-07T23:05:02Z",
  "content": "Treasury Secretary Janet Yellen sought to reassure the public on Saturday that the U.S. economy remains strong, despite a string of weak job reports that have rattled investors and weighed on the sto… [+1763 chars]"
  },
  {
  "source": {"id": null, "name": "CNET"},
  "author": "Michelle Honeyager",
  "title": "12 Probiotic Foods That Make for a Healthy, Happy Gut",
  "category": "Health",
  "description": "To maintain your gut health, consider incorporating these 12 probiotic foods into your diet.",
  "url": "https://www.cnet.com/health/nutrition/probiotic-foods-gut-health/",
  "urlToImage": "https://www.cnet.com/a/img/resize/ca6531d803a1e40d5b2f0078055190486cc1e642/hub/2024/08/30/84110b90-62ef-4f96-b33f-0d9ac0e06651/person-holding-yogurt-at-store.jpg?auto=webp&fit=crop&height=675&width=1200",
  "publishedAt": "2024-09-05T16:25:30Z",
  "content": "When it comes to discussions about gut health, probiotics are a hot topic. After all, who doesn't want a healthy gut? Perhaps you've heard of probiotic supplements or even seen them at your local pharmacy, but did you know that you can naturally consume probiotics in your food?. Probiotics are live microorganisms, often called 'good bacteria,' that help maintain a healthy balance in your gut by promoting the growth of beneficial bacteria and suppressing harmful ones,' Gillean Barkyoumb, M.S., RDN, registered dietitian and nutrition expert at Plexus Worldwide (which sells dietary supplements), explained in an email. Ultimately, probiotics contribute to your digestive health, which in turn can reduce depression, improve mental health, promote heart health, boost your immune system and give your skin a healthy glow. Good gut bacteria can also help promote a healthy metabolism, which can eliminate disorders such as obesity and diabetes."
  },
  {
    "source": {"id": "wired", "name": "Wired"},
    "author": "Steven Levy",
    "title": "The NSA Has a Podcast—Here's How to Decode It",
    "description": "The spy agency that dared not speak its name is now the Joe Rogan of the SIGINT set. And the pod's actually worth a listen.",
    "url": "https://www.wired.com/story/the-nsa-has-a-podcast-heres-how-to-decode-it-no-such-podcast/",
    "urlToImage": "https://media.wired.com/photos/66da1e7d18525d876d48cb87/191:100/w_1280,c_limit/Plaintext-NAS-Podcast-Business-1964677275.jpg",
    "publishedAt": "2024-09-06T13:00:00Z",
    "content": "My first story for WIREDyep, 31 years agolooked at a group of crypto rebels who were trying to pry strong encryption technology from the government-classified world and send it into the mainstream. N… [+4430 chars]"
  }
]